// // // // alert('Hello!Для продолжить - жми ок')

// // // Первое задание

// // // var a = 1, b = 1, c, d;
// // // c = ++a; alert(c);           // 2
// // // d = b++; alert(d);           // 1
// // // c = (2 + ++a); alert(c);      // 5
// // // d = (2 + b++); alert(d);      // 4
// // // alert(a);                    // 3
// // // alert(b);                    // 3

// // // Второе задание

// // // var a = 2;
// // // var x = 1 + (a *= 2);
// // // alert(x); //5

// // // Третье задание
// // // Объявить две целочисленные переменные a и b и задать им произвольные начальные значения.Затем написать скрипт, который работает по следующему принципу:

// // // если a и b положительные, вывести их разность;
// // // если а и b отрицательные, вывести их произведение;
// // // если а и b разных знаков, вывести их сумму; ноль можно считать положительным числом.
// // // var a = 5;
// // // var b = 3;
// // // if (a > 0 && b > 0) {
// // //     x = a - b;
// // //     alert(x);
// // // } else if (a < 0 && b < 0) {
// // //     x = a * b;
// // //     alert(x);
// // // }
// // // else if (a > 0 && b < 0 || a < 0 && b > 0) {
// // //     x = a + b;
// // //     alert(x);
// // // }


// // // Четвертое задание
// // a = +prompt('Введите число от 1 до 15');
// // switch (a) {
// //     case 1:
// //         alert('Ваши цифры: 1 ');
// //         break;
// //     case 2:
// //         alert('Ваши цифры: 1 2 ');
// //         break;
// //     case 3:
// //         alert('Ваши цифры: 1 2 3');
// //         break;
// //     case 4:
// //         alert('Ваши цифры: 1 2 3 4');
// //         break;
// //     case 5:
// //         alert('Ваши цифры: 1 2 3 4 5');
// //         break;
// //     case 6:
// //         alert('Ваши цифры: 1 2 3 4 5 6');
// //         break;
// //     case 7:
// //         alert('Ваши цифры: 1 2 3 4 5 6 7');
// //         break;
// //     case 8:
// //         alert('Ваши цифры: 1 2 3 4 5 6 7 8');  /Лень дальше))))
// //         break;
// //     case 9:
// //         alert('Ваше число 9');
// //         break;
// //     case 10:
// //         alert('Ваше число 10');
// //         break;
// //     case 11:
// //         alert('Ваше число 11');
// //         break;
// //     case 12:
// //         alert('Ваше число 12');
// //         break;
// //     case 13:
// //         alert('Ваше число 13');
// //         break;
// //     case 14:
// //         alert('Ваше число 14');
// //         break;
// //     case 15:
// //         alert('Ваше число 15');
// //         break;
// // // }
// // Пятое задание
// // var a = 2;
// // 		var b = 3;

// // 		function plus(a, b) {
// //     		return a + b;
// // 		}

// // 		function minus(a, b) {
// //     		return a - b;
// // 		}

// // 		function div (a, b) {
// //     		return a / b;
// // 		}

// // 		function mult (a, b) {
// //     		return a + b;
// // 		}
// Шестое задание
// function mathOperation(arg1, arg2, operation){
//     switch(operation){
//             case 'сложение':
//                 return arg1 + arg2;
//                 break;
//             case 'вычитание':
//                 return arg1 - arg2;
//              break;
//          case 'деление':
//                        return arg1 / arg2;
//              break;
//             case 'умножение':
//                 return arg1 * arg2;
//              break;
//        }
// }
